BAS BMEKZU Project/src/AccumulationRegisters/ИНАГРО_ЗатратыОрганизаций/ИНАГРО_ЗатратыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИНАГРО_ЗатратыОрганизаций</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСписания1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСписания2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСписания3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетСписания</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.БиологическиеАктивы</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначениеДоходовИЗатрат</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

BAS BMEKZU Project/src/Enums/ИНАГРО_ВидыОперацийПрочиеЗатраты/ИНАГРО_ВидыОперацийПрочиеЗатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИНАГРО_ВидыОперацийПрочиеЗатраты</name>
  <enumValues>
    <name>Отражение</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/AccumulationRegisters/ИНАГРО_ЗатратыОрганизаций/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаЗаписи Из ЭтотОбъект Цикл
		
		Если ТипЗнч(ЭтотОбъект.Отбор.Регистратор.Значение) = Тип("ДокументССылка.Инагро_ПрочиеЗатраты") Тогда
			Если ЭтотОбъект.Отбор.Регистратор.Значение.ВидОперации = Перечисления.ИНАГРО_ВидыОперацийПрочиеЗатраты.Списание Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаЗаписи.СчетЗатрат.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения, "ВидСубконто") = Неопределено
			И ЗначениеЗаполнено(СтрокаЗаписи.Подразделение) Тогда 
			СтрокаЗаписи.Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		КонецЕсли;
		
		Если СтрокаЗаписи.СчетЗатрат.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы, "ВидСубконто") = Неопределено
			И ЗначениеЗаполнено(СтрокаЗаписи.НоменклатурнаяГруппа) Тогда 
			СтрокаЗаписи.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
		КонецЕсли;
		
		Если СтрокаЗаписи.СчетЗатрат.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат, "ВидСубконто") = Неопределено
			И ЗначениеЗаполнено(СтрокаЗаписи.СтатьяЗатрат) Тогда 
			СтрокаЗаписи.СтатьяЗатрат = Справочники.СтатьиЗатрат.ПустаяСсылка();
		КонецЕсли;    		
		
	КонецЦикла;		
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
